#ifndef __MY_STRING_H__
#define __MY_STRING_H__

/*******************************************************************************
 * Includes
 ******************************************************************************/
/*******************************************************************************
 * Definitions
 ******************************************************************************/

/*******************************************************************************
 * Prototypes
 ******************************************************************************/

char *MS_StrAllocAndAppend(const char *str1, const char *str2);             // chèn tại cuối chuỗi
char *MS_StrAllocAndInsert(const char *str1, size_t pos, const char *str2); // Chèn tại vị trí bất kỳ
char *MS_AddParenthesesIfMissing(char *arr);

#endif /*__MY_STRING_H__*/